// // See https://aka.ms/new-console-template for more information
// Console.WriteLine("Hello, World!");

/*Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.

456 -> 5
782 -> 8
918 -> 1 

Random smt= new Random(); 

int abc = smt.Next(100,1000);

int res = (abc/10)%10;

Console.WriteLine(abc);
Console.WriteLine(res);*/