// See https://aka.ms/new-console-template for more information
// Console.WriteLine("Hello, World!");

/*Задача 13: Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет. Не использовать string[]

645 -> 5

78 -> третьей цифры нет

32679 -> 6*/



// Console.WriteLine("Введите число");

// int num = int.Parse(Console.ReadLine());


// int res = 0;

// if (num > 100) 
// {
//     res = (num /10)% 10; }
// else{
//      res = num % 10;
// }

// if (num < 100) 
// {
//     Console.WriteLine ("Третьей цифры нет"); }
// else{
//     Console.WriteLine(res);
// }





