// // See https://aka.ms/new-console-template for more information
// Console.WriteLine("Hello, World!");

/*Задача 15: Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.

6 -> да
7 -> да
1 -> нет


Console.WriteLine("Введите номер дня недели");
bool ThisDay = int.TryParse(Console.ReadLine(), out int day);

if (!(ThisDay) || day < 1 || day > 7){
    Console.WriteLine("Это вообще не номер дня недели");
} else {
    if (day < 6){
        Console.WriteLine("нет");
    } else {
        Console.WriteLine("да");
    } 
}*/